List<Map<String, dynamic>> get timeGreetings => [
      {
        'time': '00:00-04:59',
        'greetings': [
          '已经很晚了🌃',
          '早点睡哦💤',
          '熬夜小心身体哦🛌',
          '星空陪着你✨',
          '夜猫子模式开启🦉',
          '该睡觉啦🕰️',
          '安静的校园🌙',
          '夜深了🌙',
          '做个好梦🌌'
        ]
      },
      {
        'time': '05:00-10:59',
        'greetings': [
          '早上好~',
          'Good Morning☀️',
          '元气满满新的一天🤩',
          '清晨阳光灿烂✨',
          '新的一天新气象🌟',
          '学习加油哦💪',
          '校园的早晨最美好🍃'
        ]
      },
      {
        'time': '11:00-12:59',
        'greetings': [
          '中午好~',
          '中午吃饱饱🥰',
          '午饭时间到🍔',
          '想好吃什么了吗😋',
          '别忘了喝汤哦🍵',
          '午休时间🛏️',
          '放松一下吧📖',
        ]
      },
      {
        'time': '13:00-16:59',
        'greetings': [
          '下午好~',
          '来点小甜品🍰',
          '学习加油哦💪',
          '图书馆静悄悄📚',
          '校园下午茶时光☕',
          '课间别忘了多走动🏃',
          '为梦想加油🌈',
          '在课堂上坚持住！🎓'
        ]
      },
      {
        'time': '17:00-21:59',
        'greetings': [
          '晚上好~',
          '夜幕降临✨',
          '学习加油哦💪',
          '吃晚饭了吗🍛',
          '夜跑时间到🏃‍♀️',
          '晚风吹过校园✨',
        ]
      },
      {
        'time': '22:00-23:59',
        'greetings': [
          '夜深了~',
          '明天见😊',
          '睡个好觉做个美梦🌙',
          '夜猫子还在忙碌吗💻',
          '愿你有个宁静的夜晚💫',
          '一天的努力辛苦啦💼',
          '晚安，西科人🌌',
        ]
      }
    ];
